# Lógica de Código Pyplan

### Pacotes

In [10]:
import os as os
import numpy as np
import pandas as pd

#### Valor Percentual

In [9]:
# Valor Percentual = (Atual - Anterior)/Anterior 
atual = 30000
anterior = 50000
valor_percentual = ((atual - anterior)/anterior) * 100
str(valor_percentual) + ' %'

'-40.0 %'

#### Defininindo um Index com Compreensão de lista (List comprehension)

In [4]:
data  = {'Coluna1':['Regional1'],  'Coluna2':['Região Leste'], 'Coluna3':['Atacado'], 'vol_dia':[10000]}
_df = pd.DataFrame(data)
_df

     Coluna1       Coluna2  Coluna3  vol_dia
0  Regional1  Região Leste  Atacado    10000

In [5]:
_df.set_index(['Coluna1', 'Coluna2', 'Coluna3', 'vol_dia'])

Empty DataFrame
Columns: []
Index: [(Regional1, Região Leste, Atacado, 10000)]

In [6]:
_df.set_index([col for col in _df if col != 'vol_dia'])

                                vol_dia
Coluna1   Coluna2      Coluna3
Regional1 Região Leste Atacado    10000

#### Deletando Colunas

In [15]:
data = {'col1':[1,2], 'col2':[1,2], 'col3':[1,2]}
_df = pd.DataFrame(data)
_df

   col1  col2  col3
0     1     1     1
1     2     2     2

In [16]:
_df = _df.drop(columns=['col3'])
_df

   col1  col2
0     1     1
1     2     2

#### DataFrames

In [34]:
# array is rows not columns, the coluns is the values inside of array.
# [0,1,2,3]
# [1,8,3,0]
# [2,9,3,0]
# [3,2,3,0]

data = np.array([ [0,1,2,3], [1,8,3,0], [2,9,3,0], [3,2,3,0] ]) 
_df1 = pd.DataFrame(data, columns=['id', 'col1', 'col2', 'col3'])
_df1

   id  col1  col2  col3
0   0     1     2     3
1   1     8     3     0
2   2     9     3     0
3   3     2     3     0

In [36]:
data = np.array([[0,1,2,3], [1,1,2,8], [2,5,2,4], [3,9,6,8]])
_df2 = pd.DataFrame(data, columns=['id', 'col4', 'col5', 'col6'])
_df2

   id  col4  col5  col6
0   0     1     2     3
1   1     1     2     8
2   2     5     2     4
3   3     9     6     8

#### Mesclando Dataframes

In [37]:
                    
_df = _df1.merge(_df2, on=['id'], how='left')
_df

   id  col1  col2  col3  col4  col5  col6
0   0     1     2     3     1     2     3
1   1     8     3     0     1     2     8
2   2     9     3     0     5     2     4
3   3     2     3     0     9     6     8

#### Pivotando Dataframes

In [ ]:
_df = pd.pivot_table(_df, values='vol_dia', index=_cols_to_pivot,
                    columns=['metodologia'], aggfunc=np.sum).reset_index()

#### Substituindo Valores

In [ ]:
_df['vol_dia'] = np.where(_df['met_selec']=='Top Down', _df['Top Down'], _df['Bottom Up'])